Public Member Functions | List of all members
API_IObjectEventHandler Class Reference
Notifications Manager
Defining an interface for Object event handlers. More...
#include <APIdefs_Callback.h>
 Inheritance diagram for API_IObjectEventHandler:
 Public Member Functions
 virtual void  | OnCreated (const GS::HashSet< API_Guid > &) const
Event handler for object creation events.
 virtual void  | OnModified (const GS::HashSet< API_Guid > &) const
Event handler for object modification events.
 virtual void  | OnDeleted (const GS::HashSet< API_Guid > &) const
Event handler for object deletion events.
Detailed Description
Defining an interface for Object event handlers.
Since
Archicad 26